{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":21,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true,"batch_input_shape":[null,20],"dtype":"float32"}},{"class_name":"Dense","config":{"units":2,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true,"batch_input_shape":[null,21],"dtype":"float32"}},{"class_name":"Dense","config":{"units":2,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}}],"keras_version":"tfjs-layers 0.6.7","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./shape-recognition.weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[20,21],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[21],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[21,2],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[2],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[2,2],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[2],"dtype":"float32"}]}]}